import React from 'react'
import Header from '../Header/Header';
import { Helmet } from 'react-helmet';

const Shani = () => {
    return (
        <>
              {/* TODO : Add SEO ( Using helmet) add title discription & search tag */}
            <Helmet>
                <meta charSet="utf-8" />
                <title>Shani Chalisha</title>
                <link rel="canonical" href="../assests/image/favicon.ico" />
            </Helmet>

            <div className='container'>
                <div className='row'>
                    <Header text={'Shani Chalisha'} />
                    <div>
                        <img src="https://e1.pxfuel.com/desktop-wallpaper/873/825/desktop-wallpaper-dev-lord-shani-thumbnail.jpg" alt='img' className="responsive" width="600" height="400" />
                    </div>
                    <div>
                        {Doha.length > 0 && Doha.map((item, index) => {
                            return <strong key={index} className='S-fontSize'>{item.doha}<br /></strong>
                        })}
                    </div>
                    <div className='row'>
                        {Chalisha.length > 0 && Chalisha.map((item, index) => {
                            return <p key={index} className='fontSize'>{item.chopai.split(" | ")[0]}<br /></p>
                        })}
                    </div>

                    <div>
                        {Doha2.length > 0 && Doha2.map((item, index) => {
                            return <strong key={index} className='S-fontSize'>{item.doha.match(/^[^|]*/)[0]}<br /></strong>
                        })}
                    </div>

                </div>
            </div>
        </>
    )
}

export default Shani;

const Doha = [
    { doha: "जय गणेश गिरिजा सुवन, मंगल करण कृपाल। दीनन के दुख दूर करि, कीजै नाथ निहाल॥" },
    { doha: "जय जय श्री शनिदेव प्रभु, सुनहु विनय महाराज। करहु कृपा हे रवि तनय, राखहु जन की लाज॥"}
];

const Chalisha = [
    { chopai: "जयति जयति शनिदेव दयाला। करत सदा भक्तन प्रतिपाला॥" },
    { chopai: "चारि भुजा, तनु श्याम विराजै । माथे रतन मुकुट छबि(छवि) छाजै ॥" }, // छवि
    { chopai: "परम विशाल मनोहर भाला । टेढ़ी दृष्टि भृकुटि विकराला ॥" },
    { chopai: "कुण्डल श्रवन चमाचम चमके । हिय(हिये) माल मुक्तन मणि दमके(दमकै) ॥" }, // हिये, दमकै
    { chopai: "कर में गदा त्रिशूल कुठारा । पल बिच करैं अरिहिं संहारा ॥" },
    { chopai: "पिंगल, कृष्णो, छाया, नन्दन । यम, कोणस्थ, रौद्र, दुःख भंजन ॥" },
    { chopai: "सौरी, मन्द शनी दश नामा । भानु पुत्र पूजहिं सब कामा ॥" },
    { chopai: "जापर प्रभु प्रसन्न हवैं जाहीं । रंकहुं राव करैं क्षण माहीं ॥" },
    { chopai: "पर्वतहू तृण होई(होइ) निहारत । तृणहू को पर्वत करि डारत ॥" }, // होइ
    { chopai: "राज मिलत बन(वन) रामहिं दीन्हयो । कैकेइहुँ की मति हरि लीन्हयो ॥" }, // वन
    { chopai: "बनहूँ(वनहुं) में मृग कपट दिखाई । मातु जानकी गई चुराई ॥" }, // वनहुं
    { chopai: "लखनहिं(लषणहिं) शक्ति विकल करिडारा । मचिगा दल में हाहाकारा ॥" }, // लषणहिं
    { chopai: "रावण की गति-मति बौराई । रामचन्द्र सों बैर बढ़ाई ॥" },
    { chopai: "दियो कीट करि कंचन लंका । बजि बजरंग बीर की डंका ॥" },
    { chopai: "नृप विक्रम पर तुहि पगु धारा । चित्र मयूर निगलि गै हारा ॥" },
    { chopai: "हार नौलखा लाग्यो चोरी । हाथ पैर डरवायो तोरी ॥" },
    { chopai: "भारी दशा निकृष्ट दिखायो । तेलिहिं(तेलहिं) घर कोल्हू चलवायो ॥" }, // तेलहिं
    { chopai: "विनय राग दीपक महँ कीन्हयों । तब प्रसन्न प्रभु ह्वै सुख दीन्हयों ॥" },
    { chopai: "हरिश्चन्द्र नृप नारि बिकानी । आपहुं भरे डोम घर पानी ॥" },
    { chopai: "तैसे नल पर दशा सिरानी । भूंजी-मीन कूद गई पानी ॥" },
    { chopai: "श्री शंकरहिं गह्यो जब जाई । पारवती को सती कराई ॥।" },
    { chopai: "तनिक विलोकत(विकलोकत) ही करि रीसा । नभ उड़ि गयो(गतो) गौरिसुत सीसा ॥" }, // विकलोकत, गतो
    { chopai: "पाण्डव पर भै दशा तुम्हारी । बची द्रोपदी होति उधारी ॥" },
    { chopai: "कौरव के भी गति मति मारयो । युद्ध महाभारत करि डारयो ॥" },
    { chopai: "रवि कहँ मुख महँ धरि तत्काला । लेकर कूदि परयो पाताला ॥" },
    { chopai: "शेष देव-लखि विनती लाई । रवि को मुख ते दियो छुड़ाई ॥" },
    { chopai: "वाहन प्रभु के सात सुजाना । जग दिग्गज गर्दभ मृग स्वाना ॥" },
    { chopai: "जम्बुक सिह आदि नख धारी । सो फल ज्योतिष कहत पुकारी ॥" },
    { chopai: "गज वाहन लक्ष्मी गृह आवैं । हय ते सुख सम्पत्ति उपजावै ॥" },
    { chopai: "गर्दभ हानि करै बहु काजा । सिह सिद्ध्कर राज समाजा ॥" },
    { chopai: "जम्बुक बुद्धि नष्ट कर डारै । मृग दे कष्ट प्राण संहारै ॥" },
    { chopai: "जब आवहिं प्रभु स्वान सवारी । चोरी आदि होय डर भारी ॥" }, // prabhu
    { chopai: "तैसहि चारि चरण यह नामा । स्वर्ण लौह चाँदी अरु तामा ॥" },
    { chopai: "लौह चरण पर जब प्रभु आवैं । धन जन सम्पत्ति नष्ट करावैं ॥" },
    { chopai: "समता ताम्र रजत शुभकारी । स्वर्ण सर्वसुख मंगल भारी ॥" },
    { chopai: "जो यह शनि चरित्र नित गावै । कबहुं न दशा निकृष्ट सतावै ॥" },
    { chopai: "अद्भुत नाथ दिखावैं लीला । करैं शत्रु के नशि बलि ढीला ॥" },
    { chopai: "जो पण्डित सुयोग्य बुलवाई । विधिवत शनि ग्रह शांति कराई ॥" },
    { chopai: "पीपल जल शनि दिवस चढ़ावत । दीप दान दै बहु सुख पावत ॥" },
    { chopai: "कहत राम सुन्दर प्रभु दासा । शनि सुमिरत सुख होत प्रकाशा ॥" },
];

const Doha2 = [
    { doha: "पाठ शनिश्चर देव को, की हों 'भक्त' तैयार। करत पाठ चालीस दिन, हो भवसागर पार॥" },
];